Repository: 84000/data-translation-memory
Catalog: toh112-v3.tmx
Source language: bo
Languages: en

source: དགའ་བ་དང་། ཡིད་བདེ་བ་དང་། མཆོག་ཏུ་དགའ་བས་ཏ་ལ་བདུན་སྲིད་ཙམ་དུ་སྟེང་གི་བར་སྣང་ལ་མངོན་པར་འཕགས་ཤིང་ཐལ་མོ་སྦྱར་ཏེ་འཁོད་ནས། བཅོམ་ལྡན་འདས་ལ་དབྱངས་གཅིག་གིས་ཚིགས་སུ་བཅད་དེ་གསོལ་པ། སངས་རྒྱས་ཉི་མ་བཞིན་དུ་ལྷང་ངེ་ཞིང་།
en: Their joy, happiness, and delight caused them to rise in the air to the height of seven palm trees, and remaining there, with palms placed together, they sang in unison these verses to the Bhagavat: “Buddha, you shine as bright as the sun.

source: །འཇིག་རྟེན་འདི་ན་མངོན་འཕགས་ལྷུན་པོ་འདྲ།
en: In this world you are as high as Meru.

source: །རྣམ་འདྲེན་རྡུལ་བྲལ་རྣམ་དག་སྤྱན་མངའ་བ།
en: You are the spotless guide with pure eyes.

source: །སྣང་གྱུར་བདེ་གཤེགས་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ།
en: We pay homage to you, Sugata who is the light. “

source: །ཁྱོད་ནི་བྱང་ཆུབ་དམ་པ་ཚོལ་བ་ན། །བསྐལ་པ་མང་པོར་ཁྱོད་ཀྱིས་བརྩོན་འགྲུས་བསྒོམས།
en: You have diligently meditated for many eons, Seeking supreme enlightenment.

source: །ཁྱོད་ཀྱིས་སྔོན་གྱི་རྒྱལ་མང་གང་མཆོད་པ། །འདས་པའི་འདྲེན་པ་དེ་ཡིས་ལུང་མ་བསྟན།
en: In the past you have made offerings to many jinas, But the guides of the past did not give a prophecy to you. “

source: །འདོད་ཆགས་སྤངས་པ་ཡོངས་གྲོལ་ཐུགས་མངའ་བ།
en: You have abandoned desire and you have a liberated mind.

source: །ཁྱོད་འདིར་འཇིག་རྟེན་ཀུན་ཏུ་མཛད་པ་མཛད།
en: You accomplished the deeds all over this world.

source: །ལམ་སྟོར་རྣམས་ལ་ཆོས་ཀྱང་སྟོན་མཛད་ཅིང་།
en: You teach the Dharma to those who have lost the path.

source: །སེམས་ཅན་རྣམས་ཀྱང་སྲིད་པའི་མཚོ་ལས་བསྒྲལ།
en: You save beings from the ocean of existence. “

source: །རང་བྱུང་བསྟན་ལ་བདག་ཅག་རབ་བྱུང་ཞིང་། །དབང་པོ་མཉམ་བཞག་རྒྱལ་བས་བསྟན་པ་ཡི། །སོ་སོར་ཐར་པའི་བསླབ་པ་དེ་བསླབས་ནས།
en: We have taken ordination in the self-arisen teachings, And, having composed sense faculties, we have trained In the training of the prātimokṣa that you, Jina, taught.

source: །བདག་ཅག་རྟག་ཏུ་ཁྱོད་དང་ཉེར་གྱུར་ཅིག །
en: We will always remain beside you. “

source: སྲོག་ལ་བརྟེན་པ་མ་མཆིས་ཆོས་འཚལ་ཞིང་།
en: We have not followed desire for the activities of this life.

source: །སྟོན་པར་འདུ་ཤེས་ཆོས་རྣམས་མཉན་བགྱིས་ནས། །རྒྱལ་བས་མངོན་པར་ལུང་བསྟན་དོན་དེ་ཡི།
en: Seeing you as the teacher, we have listened to the Dharma.

source: །རོ་མྱོང་དབང་བསྐུར་ས་ཡང་ཐོབ་གྱུར་ཅིག །
en: We will obtain the taste of the level of consecration.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Jina, you have prophesied this attainment.”

source: རིགས་ཀྱི་བུ་སྐྱེས་བུ་དམ་པ་ལེགས་དགའ་དང་། རབ་ཏུ་ལག་བརྐྱང་ཞེས་བྱ་བ་དེ་གཉིས་དང་།
en: The Bhagavat said, “Noble sons, those two noble sons have developed the aspiration for enlightenment.

source: སས་བྱིན་དང་།
en: They are Saṃrocana and Prahasitabāhu.

source: བརྩོན་འགྲུས་ཡང་དག་སྐུལ་དང་། སྙིང་པོ་མེ་ཏོག་རྒྱས་དང་། ཤེས་རབ་འོད་ཟེར་ཀུན་འཁྲུགས་འཛིན་ཅེས་བྱ་བ་བཞི་དང་།
en: The other four are Dharaṇidatta, Vīryasaṃcodana, Sārakusumita, and Prajñārciḥsaṃkopitadaṣṭa.

source: སྐྱེས་བུ་དམ་པ་དྲུག་པོ་དེ་དག་གིས་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་ལས་ངས་དང་པོ་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་བཅུག་པ་དེ་དག་ཉོན་ཅིག །
en: Listen, for I made these six worthy beings first aspire to enlightenment. “

source: རིགས་ཀྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་བསྐལ་པ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་འདས་པར་གྱུར་པ་དེའི་ཚེ་དེའི་དུས་ན་སངས་རྒྱས་ཀྱི་ཞིང་འདི་རྡུལ་མེད་ལྷུན་པོ་སྤོས་ཞེས་བྱ་བར་གྱུར་ཏེ།
en: Noble sons, in times gone by, in the past—countless, innumerable eons ago—in that age, at that time, this buddha realm was called Arajamerujugupsita.

source: རིགས་ཀྱི་བུ་དེའི་ཚེ་བསྐལ་པ་ཆེན་པོ་བྱུང་བ་ན་སྐྱེ་དགུའི་ཚེ་ལོ་བརྒྱ་ཐུབ་ཅིང་དེ་བཞིན་གཤེགས་པ་སྤོས་ཀྱི་པད་མའི་བསྟན་པ་དམ་པའི་ཆོས་ཀྱི་གཟུགས་བརྙན་དུ་གྱུར་པ་དེའི་ཚེ་དེའི་དུས་ན་ང་འཛམ་བུའི་གླིང་ལས་རྣམ་པར་རྒྱལ་བའི་སྟོབས་ཀྱི་འཁོར་ལོས་སྒྱུར་བ་ནོར་ངན་ཅེས་བྱ་བར་གྱུར་ཅིང་བུ་ཡང་སྟོང་ཡོད་པར་གྱུར་ནས། ངས་དེ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་བཅུག་གོ། །དེ་དག་ཀྱང་དུས་གཞན་ཞིག་ན་མངོན་པར་བྱུང་སྟེ།
en: In that great eon, when the lifespan of beings was a hundred years, in the time of the outer image of the Dharma of the Tathāgata Gandhapadma, I, noble sons, at that time became a powerful cakravartin named Durdhana who was victorious over Jambudvīpa. I had a thousand sons, and I made them aspire to the highest enlightenment.

source: དེ་བཞིན་གཤེགས་པ་སྤོས་ཀྱི་པད་མའི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་དེ་དག་གིས་དེ་བཞིན་གཤེགས་པ་སྟོབས་ཀྱི་པད་མའི་བསྟན་པ་རྒྱ་ཆེར་འབར་བར་བྱས་སོ།
en: They later left home and took ordination in the teaching of the Tathāgata Gandhapadma, and they made the teaching of the Tathāgata Gandhapadma shine brightly.

source: །གང་དག་རབ་ཏུ་མ་བྱུང་ཞིང་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་མི་འདོད་པ་བུ་དྲུག་ཅིག་མ་གཏོགས་ཏེ།
en: There were six sons who did not take ordination and who did not wish to develop the aspiration for enlightenment.

source: ངས་དེ་དག་ལ་ཡང་དང་ཡང་དུ་བསྒོ་བ། ཁྱེད་ཅག་བསམ་པ་ཇི་ལྟ་བུ་ཞིག་གིས་ན་ཁྱེད་རབ་ཏུ་མི་འབྱུང་ཞིང་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་མི་བྱེད།
en: I commanded them repeatedly, saying, ‘What are you thinking that makes you not take ordination or develop the aspiration for enlightenment?’

source: དེ་དག་གིས་སྨྲས་པ། བདག་ཅག་ནི་རབ་ཏུ་མི་འབྱུང་ལགས་སོ།
en: They replied, ‘We will not take ordination.

source: གང་ཟད་པའི་དུས་ཀྱི་མཐར་དམ་པའི་ཆོས་གཟུགས་བརྙན་དུ་གྱུར་པ་ན་རབ་ཏུ་བྱུང་བ་དེས་ནི་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་མཐའ་དག་ཀུན་ཏུ་འཛིན་པར་ཡང་རྔོ་མི་ཐོགས་ལ།
en: It is because in the age of degeneracy, when there is only the outer image of the Dharma, those who take ordination will not be able to maintain the entire array of good conduct.

source: དེ་ནོར་བདུན་དང་ཡང་བྲལ་བར་འགྱུར་ཞིང་འཁོར་བའི་འདམ་དུ་བྱིང་ནས། དེས་སླར་རེས་འགའ་ཞིག་ལྷ་དང་མིའི་དཔལ་ཐོབ་པར་བས་ཀྱི། རྟག་ཏུ་ངན་སོང་གསུམ་པོ་དག་ཏུ་ཡོངས་སུ་འཁྱམ་པར་འགྱུར་ཞིང་།
en: They will be devoid of the seven riches, sink in the swamp of saṃsāra, and occasionally obtain the splendor of devas and humans, but otherwise they will always wander in the three lower existences.

source: སངས་རྒྱས་ཀྱི་བསླབ་པ་ཡང་དག་པར་འཛིན་པར་མི་འགྱུར་ཏེ།
en: They will not be able to truly maintain the training of the Buddha.

source: དེའི་སླད་དུ་བདག་ཅག་རབ་ཏུ་མི་འབྱུང་བ་ལགས་སོ།
en: Therefore, we will not take ordination.’ “

source: །ངས་ཡང་དེ་དག་ལ་དྲིས་པ། ཁྱེད་ཅག་ཅིའི་ཕྱིར་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་མི་བྱེད། དེ་དག་གིས་སྨྲས་པ།
en: Then I asked them, ‘Why aren’t you going to develop the aspiration for enlightenment?’ “

source: གལ་ཏེ་བདག་ཅག་ལ་འཛམ་བུའི་གླིང་ཐམས་ཅད་སྩལ་ན། དེ་ལྟ་ན་བདག་ཅག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་བགྱིའོ།
en: They answered, ‘If you gave us the entirety of Jambudvīpa, then we would make the aspiration for the highest, most complete enlightenment.’ “

source: །རིགས་ཀྱི་བུ་ངས་དེ་ཐོས་ནས་མཆོག་ཏུ་དགའ་བའི་ཡིད་ཀྱིས་འདི་སྙམ་དུ་བསམས་ཏེ། ངས་འཛམ་བུའི་གླིང་གི་མི་ཐམས་ཅད་གསུམ་ལ་སྐྱབས་སུ་འགྲོ་བ་ལ་རབ་ཏུ་བཀོད་ཅིང་འཕགས་པའི་གསོ་སྦྱོང་ཡན་ལག་བརྒྱད་དང་ལྡན་པ་ལ་གནས་པ་ཡང་ཡང་དག་པར་འཛིན་ཏུ་བཅུག་སྟེ། ཐེག་པ་གསུམ་པོ་དག་ཀྱང་ཡང་དག་པར་འཛིན་དུ་བཅུག་ཟིན་གྱིས།
en: Noble son, when I heard that I was filled with joy and thought, ‘I have made all the people in Jambudvīpa take refuge in the Three Jewels and keep the eight upoṣadha vows.

source: གང་བདག་གིས་འཛམ་བུའི་གླིང་འདི་ཆ་དྲུག་ཏུ་བགོས་ཏེ་བུ་དྲུག་པོ་དག་ལ་བྱིན་ལ་བྱིན་ནས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་གཞུག་ཅིང་བདག་ཀྱང་མངོན་པར་བྱུང་སྟེ།
en: I will divide Jambudvīpa into six parts and give them to my six sons and then have them make the aspiration for the highest, most complete enlightenment. Then I will leave home and become ordained.’ “

source: རབ་ཏུ་བྱུང་བར་བྱ་གོར་མ་ཆག་སྙམ་ནས་ངས་དེ་བཞིན་དུ་འཛམ་བུའི་གླིང་ཐམས་ཅད་ཆ་དྲུག་ཏུ་བགོས་ཏེ། བུ་དྲུག་པོ་དག་ལ་བྱིན་ནས་བདག་ཀྱང་མངོན་པར་བྱུང་སྟེ། རབ་ཏུ་བྱུང་བ་དང་།
en: In that way, I divided Jambudvīpa into six parts and gave them to my six sons, and I left home and became ordained. “

source: འཛམ་བུའི་གླིང་གི་རྒྱལ་པོ་དེ་དག་ཀྱང་ཕན་ཚུན་མི་འཐུན་ཞིང་འཐབ་པ་དང་། མཚང་འདྲུ་བ་དང་། འགྱེད་པ་དང་། ནད་དང་། ཕ་རོལ་གྱི་འཁོར་གྱིས་འཁྲུག་པ་དང་། རྩོད་པ་དག་བྱུང་ངོ་། །དེའི་ཕྱིར་འཛམ་བུའི་གླིང་ཐམས་ཅད་དུ་མུ་གེ་བྱུང་སྟེ། ལོ་ཏོག་རྣམས་ཀྱང་མི་སྐྱེ། ཆར་པ་ཡང་མི་འབབ།
en: Then those kings of Jambudvīpa became hostile toward each other, and there was war, strife, discord, disease, enemy armies, chaos, and quarrels.

source: ཤིང་ལྗོན་པ་དག་ལས་ཀྱང་ལོ་མ་དང་། མེ་ཏོག་དང་། འབྲས་བུ་དག་མི་སྐྱེ། སྨན་དང་། རྩྭ་དག་ཀྱང་མི་སྐྱེ་བས་རི་དགས་དང་བྱ་རྣམས་ཀྱང་བཀྲེས་པ་དང་སྐོམ་པས་ལུས་རབ་ཏུ་འབར་ཞིང་ཉམ་ཐག་པར་གྱུར་ཏོ།
en: As a result, throughout Jambudvīpa there was famine, harvests were failing, rain did not fall, no leaves, flowers, or fruits grew on trees, even herbs and grass would not grow, and the animals and birds were in distress, burning with hunger and thirst. “

source: །དེའི་ཚེ་ན་ང་འདི་སྙམ་དུ་སེམས་ཏེ། ངས་ད་ལྟར་གྱི་ལུས་འདི་ཡོངས་སུ་བཏང་སྟེ། རང་གི་ཤ་དང་ཁྲག་གིས་སེམས་ཅན་རྣམས་ཚིམ་པར་བྱའོ་སྙམ་ནས། དེ་ནས་ངས་གནས་ཡོངས་སུ་སྤངས་ཏེ།
en: At that time, I thought, ‘If I now give up this body, I will be able to satisfy beings with my flesh and blood.’ “

source: ཡུལ་གྱི་དབུས་སུ་སོང་ནས་རི་ཆུ་སྐྱོང་ཞེས་བྱ་བ་ལ་འཛེགས་ཏེ་སྨོན་ལམ་བཏབ་པ། འདི་ལྟར་རང་གི་ལུས་སྲོག་གཏོང་བ་ནི། །སྙིང་རྗེའི་ཕྱིར་ཏེ་མཐོ་རིས་ཕྱིར་མ་ཡིན། །རི་འདིའི་འཕང་ཙམ་དག་ཏུ་གྱུར་ནས་ནི། །ལྷར་བཅས་འཇིག་རྟེན་དོན་དུ་འགྱུར་བར་ཤོག །
en: Then I left my abode, went to the center of the land, climbed Mount Dagapāla, and made this prayer: “ ‘In this way, I give my body and my life Out of compassion and not for the higher realms; May it become as large as this mountain And be of benefit for the world and its devas. “ ‘

source: འདི་ལྟར་གཟུགས་མཛེས་ཕུན་སུམ་གཏོང་བ་ནི། །བདུད་ཕྱིར་མ་ཡིན་བརྒྱ་བྱིན་ཚངས་ཕྱིར་མིན།
en: In this way, I am not giving this perfectly handsome body In order that I become a māra or a śakra or a brahmā.

source: །བདག་གི་ཤ་ཁྲག་མང་པོར་གྱུར་ནས་ནི། །ལྷར་བཅས་འཇིག་རྟེན་དོན་ནི་བྱེད་གྱུར་ཅིག །
en: May my flesh and blood multiply To benefit the world and its devas. “ ‘

source: གང་དག་རི་དང་བྲག་ལ་གནས་པ་ཡི། །ལྷ་ཀླུ་གནོད་སྦྱིན་ལྷ་མིན་མི་རྣམས་ཉོན། །སེམས་ཅན་ཕྱིར་ནི་བདག་གིས་བརྩེ་བསྐྱེད་དེ། །རང་གི་ཤ་ཁྲག་དག་གིས་ཚིམ་པར་བྱ།
en: Listen, devas, nāgas, yakṣas, asuras, and humans Who are dwelling on this rocky mountain— I have developed kindness for the sake of beings, So may my flesh and blood bring satisfaction to beings.’ “

source: །གང་གི་ཚེ་ངས་སྨོན་ལམ་དེ་ལྟ་བུ་བཏབ་པ་ན། འཇིག་རྟེན་གསུམ་འཁྲུགས་ཤིང་ས་ཡང་གཡོས། ལྷུན་པོ་ཡང་འགུལ། ལྷའི་ཚོགས་རྣམས་ཀྱང་ངུའོ།
en: When I made that prayer, the three realms shook, the ground quaked, Meru quivered, and the devas wept.

source: །དེ་ནས་ངས་རང་གི་ལུས་རི་ཆུ་སྐྱོང་གི་ཁ་ནས་བོར་བ་དང་།
en: Then I threw myself off the top of Mount Dagapāla.

source: སྨོན་ལམ་གྱི་དབང་གིས་ངའི་ལུས་རིའི་ཚད་ཙམ་དུ་གྱུར་ཅིང་། མགོ་འབུམ་ཕྲག་དུ་མ་ཡོད་པར་གྱུར་ལ།
en: Through the power of my prayer, my body became the size of the mountain, and it had many hundreds of thousands of heads.

source: ཁྱོན་དུ་ནི་དཔག་ཚད་བརྒྱ། འཕང་དུ་ཡང་དཔག་ཚད་བརྒྱར་གྱུར་ནས།
en: It was a hundred yojanas wide and a hundred yojanas high.

source: མི་དང་། རི་དགས་དང་། བྱའི་བར་དག་གིས་ཀྱང་ཤ་དང་ཁྲག་བཟའ་བར་བརྩམས་སོ།
en: Humans, animals, and birds came to feed on its flesh and blood.

source: །རིགས་ཀྱི་བུ་ངའི་ལུས་ལ་སེམས་ཅན་དེ་དག་གིས་ཟོས་པ་ན་ཉིན་གཅིག་བཞིན་དུ་ཕྱིར་སྐྱེ་ཞིང་ཁྱོན་དུ་ཡང་དཔག་ཚད་འབུམ། འཕང་དུ་ཡང་དཔག་ཚད་འབུམ་ཡོད་པར་འགྱུར་ལ། ཐམས་ཅད་ནས་མིའི་མགོ་བོ་སྐྲ་དང་། རྣ་བ་དང་། མིག་དང་བཅས་པ།
en: Noble son, when those beings fed on my body, each day it would grow larger to become a hundred thousand yojanas wide and a hundred thousand yojanas high, and upon it appeared many hundreds of thousands of human heads with hair, ears, eyes, lips, and teeth.

source: མཆུ་དང་སོ་དང་བཅས་པ། ལྕེ་དང་བཅས་པའི་ཁ་འབུམ་ཕྲག་དུ་མ་དག་བྱུང་བར་གྱུར་ནས།
en: And there appeared many hundreds of thousands of mouths with tongues.

source: ཁ་འབུམ་ཕྲག་དུ་མ་པོ་དེ་དག་ནས་མིའི་སྐད་ཀྱིས་སྒྲ་སྒྲོགས་པ། ཀྱེ་སེམས་ཅན་དག་ཅི་འདོད་པ་ལོང་ཤིག །ཀྱེ་ཤ་ཟོ་ཤིག །
en: Those mouths spoke with human voices, saying, ‘O beings, satisfy your desires!

source: ཁྲག་འཐུང་ཤིག །མིག་དག་ཁྱེར་ཅིག །རྣ་བ་དང་། སྣ་དང་། སྐྲ་དང་། མཆུ་དང་།
en: Oh, eat the flesh, drink the blood, take the eyes, take the ears, noses, hair, lips, teeth, and tongues.

source: སོ་དང་། ལྕེ་དག་ཁྱེར་ཅིག །གང་འདོད་པ་དང་། གང་གིས་འདོད་པ་དང་། ཇི་སྙེད་འདོད་པས་ལུས་ཚིམ་པར་གྱུར་ཅིག །
en: Whatever you want, whoever wants it, however much you want, may this body satisfy you.

source: བསམ་པ་ཡོངས་སུ་རྫོགས་པར་གྱུར་པ་རྣམས་ནི་ཉན་ཐོས་ཀྱི་ཐེག་པའམ། རང་སངས་རྒྱས་ཀྱི་ཐེག་པའམ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་ཅིག །
en: May your wishes be completely fulfilled, and may you develop the aspiration for the highest, most complete enlightenment, or for the Śrāvakayāna, or the Pratyekabuddhayāna.

source: ཁྱེད་ཀྱི་ལོངས་སྤྱོད་དང་།
en: May your enjoyment of consuming this never end.

source: ཡོངས་སུ་སྤྱོད་པ་འདི་ནི་ཟད་པར་ཡང་མི་འགྱུར་ལ། ཁྱེད་ལ་དད་པས་བྱིན་པར་ཡང་མི་འགྱུར་གྱིས། ཁྱེད་ཅག་མྱུར་བ་ཉིད་དུ་སྲོག་ཟད་པར་ཡང་མ་གྱུར་ཅིག་ཅེས་སྒྲ་སྒྲོགས་པར་བྱེད་དོ།
en: This will not be a gift to you dependent on your faith, and may your lives not quickly come to an end.’ “

source: །དེ་ན་སེམས་ཅན་མཁས་པ་གང་ཡིན་པ་དེ་དག་ལས་ཁ་ཅིག་ནི་ཉན་ཐོས་ཀྱི་ཐེག་པར་སེམས་སྐྱེད་པར་བྱེད། ཁ་ཅིག་ནི་རང་སངས་རྒྱས་ཀྱི་ཐེག་པར་སེམས་སྐྱེད་པར་བྱེད། ཁ་ཅིག་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་པར་བྱེད་དོ།
en: Some worthy beings then developed the aspiration for the Śrāvakayāna, some developed the aspiration for the Pratyekabuddhayāna, and some developed the aspiration for the highest, most complete enlightenment.

source: །ཁ་ཅིག་ནི་ལྷ་དང་མིར་སྐྱེ་བར་སེམས་སྐྱེད་པར་བྱེད་ཅིང་།
en: Some developed the aspiration for rebirth as a deva or human.

source: ཤ་ནི་ཟ། ཁྲག་ནི་འཐུང་ངོ་།
en: They ate my flesh, and they drank my blood.

source: །ཁ་ཅིག་གིས་ནི་མིག་དག་ཁྱེར། ཁ་ཅིག་གིས་ནི་རྣ་བ་དག །ཁ་ཅིག་གིས་ནི་སྣ་དག །ཁ་ཅིག་གིས་ནི་མཆུ་དག །
en: Some took away my eyes, some my ears, some my noses, some my lips, and some my teeth.

source: ཁ་ཅིག་གིས་ནི་སོ་དག་བླངས་ནས་ཁྱེར་ཏེ་དོང་ཡང་སྨོན་ལམ་གྱི་དབང་གིས་ཤ་བྲི་བར་ཡང་མ་གྱུར། ཡོངས་སུ་ཟད་པར་ཡང་མ་གྱུར་ལ། ཡང་དང་ཡང་ཕྱིར་སྐྱེས་པར་གྱུར་ཏོ།
en: Through the power of my prayer my flesh did not diminish and did not come to an end but kept on growing.

source: །ལོ་ཁྲིའི་བར་དུ་འཛམ་བུའི་གླིང་གི་མི་ཐམས་ཅད་དང་། གནོད་སྦྱིན་དང་། རི་དགས་དང་། བྱ་རྣམས་ཀྱང་ངའི་ལུས་ཀྱིས་ཚིམ་པར་བྱས་ཏེ།
en: For ten thousand years my body satisfied all humans, yakṣas, animals, and birds.

source: ངས་ལོ་ཁྲི་པོ་དེའི་བར་དུ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་མིག་དག་ཡོངས་སུ་བཏང་ངོ་།
en: During those ten thousand years I gave away as many eyes as there are grains of sand in the Ganges River.

source: །ངས་རྒྱ་མཚོ་བཞིའི་ཆུ་སྙེད་ཀྱི་ཁྲག་དག་ཡོངས་སུ་བཏང་ངོ་།
en: I gave away as much blood as there is water in the four oceans.

source: །ངས་རི་རབ་སྟོང་སྙེད་ཙམ་གྱི་ཤ་དག་ཡོངས་སུ་བཏང་ངོ་།
en: I gave away as much flesh as would make a thousand Sumerus.

source: །ངས་རི་ཁོར་ཡུག་ཙམ་གྱི་ལྕེ་དག་ཡོངས་སུ་བཏང་ངོ་།
en: I gave away as many tongues as would make the Cakravāḍa Mountain.

source: །ངས་ལྷུན་པོ་དང་གཉའ་ཤིང་འཛིན་ཙམ་གྱི་རྣ་བ་དག་ཡོངས་སུ་བཏང་ངོ་།
en: I gave away as many ears as would make Mount Meru and Yugandhara.

source: །ངས་རི་རབ་ཙམ་གྱི་སྣ་རྒྱ་ཆེན་པོ་དག་ཡོངས་སུ་བཏང་ངོ་།
en: I gave away as many noses as would make vast Sumeru.

source: །ངས་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་འདི་ཙམ་གྱི་སོ་དག་ཡོངས་སུ་བཏང་ངོ་།
en: I gave away as many teeth as would make this Vulture Peak Mountain.

source: །ངས་དེར་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་མཐའ་དག་གིས་གཞི་ཙམ་གྱི་རང་གི་པགས་པ་ཡང་ཡོངས་སུ་བཏང་ངོ་།
en: I gave away as much skin as would cover the entire ground of the Sahā buddha realm.

source: །རིགས་ཀྱི་བུ་དེ་ལྟར་ལོ་ཁྲིའི་བར་དུ་སྲོག་གཅིག་གིས་རང་གི་ལུས་ཡོངས་སུ་བཏང་བ་ཚད་མེད་གྲངས་མེད་དཔག་ཏུ་མེད་པ་དག་ཡོངས་སུ་བཏང་ཞིང་། དེ་ལྟར་སེམས་ཅན་ཚད་མེད་གྲངས་མེད་དཔག་ཏུ་མེད་པ་དག་ཚིམ་པར་བྱས་ཀྱང་ངའི་སེམས་སྐད་ཅིག་གཅིག་ཙམ་ཡང་འགྱོད་པར་མ་གྱུར་པ་ལ་ལྟོས། དེར་ངས་སྨོན་ལམ་འདི་ལྟ་བུ་ཡང་བཏབ་སྟེ། གལ་ཏེ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བ་ལྟ་ན། བདག་གི་བསམ་པ་འདི་ཡང་ཡོངས་སུ་རྫོགས་པར་གྱུར་ཅིག །
en: Noble son, see how for ten thousand years—in one lifetime—I made immeasurable, incalculable, innumerable gifts of my body and in that way satisfied countless, innumerable, incalculable beings, without even an instant of regret. “

source: ཇི་ལྟར་བདག་གིས་གླིང་གཅིག་ཏུ་རང་གི་ལུས་ཀྱིས་སེམས་ཅན་ཐམས་ཅད་ཚིམ་པར་བྱས་པ་དེ་བཞིན་དུ་སངས་རྒྱས་ཀྱི་ཞིང་རྡུལ་མེད་ལྷུན་པོ་སྤོས་འདིའི་གླིང་ཐམས་ཅད་དུ་ཡང་ལོ་སྟོང་ཕྲག་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་དེ་ལྟ་བུའི་ལུས་འབྱུང་བར་གྱུར་ཅིག །གླིང་གཅིག་ཏུ་ལོ་ཁྲིའི་བར་དུ་ཇི་ལྟ་བ་དེ་བཞིན་དུ་གླིང་ཐམས་ཅད་དུ་ཡང་རང་གི་ཤ་དང་། ཁྲག་དང་། པགས་པ་དང་། མིག་དང་།
en: At that time, I prayed in this way: ‘If I am to attain the complete enlightenment of perfect buddhahood, then may this wish of mine be fulfilled: Just as I have satisfied all the beings in one continent with my body, may I have that kind of body in this buddha realm, Arajamerujugupsita, for as many thousands of years as there are grains of sand in the Ganges River.

source: རྣ་བ་དང་། སྣ་དང་། མཆུ་དང་། ལྕེ་དང་། སྐྲ་དག་གིས་སེམས་ཅན་ཐམས་ཅད་ཚིམ་པར་བྱས་ཤིང་ཐེག་པ་གསུམ་པོ་དག་ཡང་དག་པར་འཛིན་དུ་བཅུག་པར་གྱུར་ཅིག །མི་རྣམས་དང་།
en: Just as I have done in one continent for ten thousand years, may I in all continents satisfy beings with my flesh, blood, skin, eyes, ears, nose, lips, tongue, and hair, and make them enter the three yānas.

source: གནོད་སྦྱིན་དང་། སྲིན་པོ་རྣམས་དང་། དུད་འགྲོའི་སྐྱེ་གནས་ཐམས་ཅད་དང་། གང་དག་ཤ་ཟ་ཞིང་ཁྲག་འཐུང་བ་སོ་སོའི་གནོད་སྦྱིན་རྣམས་དང་། ཐ་ན་གཤིན་རྗེའི་འཇིག་རྟེན་གྱི་བར་དེ་དག་ཀྱང་བདག་གིས་ཚིམ་པར་བྱེད་པར་གྱུར་ཅིག །
en: May I satisfy all humans, yakṣas, rākṣasas, and animals, the particular yakṣas who eat flesh and drink blood, and even the beings in Yama’s realm.

source: ཇི་ལྟར་བདག་གིས་སངས་རྒྱས་ཀྱི་ཞིང་གཅིག་ཏུ་རང་གི་ལུས་ཀྱིས་སེམས་ཅན་ཐམས་ཅད་ཚིམ་པར་བྱེད་པར་འགྱུར་བ་དེ་བཞིན་དུ། ཕྱོགས་བཅུ་ཀུན་གྱི་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ཏུ་ཡང་རང་གི་ཤ་དང་། ཁྲག་དང་། པགས་པ་དང་། མིག་དང་།
en: Just as I have satisfied all beings in one buddha realm, may I have that kind of body in the buddha realms in the ten directions, which are as numerous as the grains of sand in the Ganges River, and for as many great eons as there are grains of sand in the Ganges River, may I satisfy beings in each buddha realm with my life and body, with my flesh, blood, skin, eyes, ears, nose, lips, and tongue.

source: ལྕེའི་བར་དག་དང་། དེ་ལྟ་བུའི་ལུས་ཀྱིས་བསྐལ་པ་ཆེན་པོ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་སངས་རྒྱས་ཀྱི་ཞིང་དེ་དང་དེ་དག་ཏུ་དེ་ལྟ་བུའི་ལུས་ཐོབ་ནས་རང་གི་ལུས་དང་སྲོག་གིས་སེམས་ཅན་རྣམས་ཚིམ་པར་བྱེད་པར་གྱུར་ཅིག །གལ་ཏེ་བདག་སེམས་ཅན་རྣམས་ཚིམ་པར་བྱ་བའི་ཕྱིར་རང་གི་ལུས་དེ་ལྟ་བུ་དག་ཡོངས་སུ་གཏོང་བར་མི་བྱེད་དམ། ཇི་ལྟར་བདག་རེ་ཞིང་སེམས་པའི་སྨོན་ལམ་དེ་ལྟ་བུ་ཡོངས་སུ་རྫོགས་པར་མ་གྱུར་ན་བདག་གིས་གང་དག་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་གཞན་དང་། གཞན་དག་ན་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་ནས་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་བསླུས་པར་གྱུར་ཅིག །
en: If I do not give away my body in order to satisfy beings, or if the aspiration of my prayer is not fulfilled in that way, then I will have broken my promise to the bhagavat buddhas who reside, live, and remain, teaching the Dharma in other buddha realms in the ten directions.

source: བདག་འཁོར་བ་ན་འཁོར་བའི་ཚེ་སངས་རྒྱས་ཀྱི་སྒྲ་ཐོས་པར་མ་གྱུར་ཅིག །ཆོས་ཀྱི་སྒྲ་ཡང་མི་ཐོས། དགེ་འདུན་གྱི་སྒྲ་ཡང་མི་ཐོས། ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒྲ་ཡང་མི་ཐོས། བདུད་ཀྱི་དཔུང་ཕམ་པའི་སྒྲ་ཡང་མི་ཐོས།
en: While I am in saṃsāra may I then not hear the word Buddha, the word Dharma, the word Saṅgha, the word perfections, the words defeating Māra’s army, or the word fearlessness—in saṃsāra may I not even hear the word good, and may I forever dwell in the great Avīci Hell.’ “

source: མི་འཇིགས་པའི་སྒྲ་ཡང་མི་ཐོས་པ་ནས། འཁོར་བ་ན་དགེ་བའི་སྒྲའི་བར་ཡང་ཐོས་པར་མི་འགྱུར་ཞིང་།
en: That is the prayer that I made.

source: རྟག་ཏུ་མནར་མེད་པའི་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་ན་གནས་པར་གྱུར་ཅིག་ཅེས་སྨོན་ལམ་དེ་ལྟ་བུ་ཡང་བཏབ་བོ། །ཇི་ལྟར་སངས་རྒྱས་ཀྱི་ཞིང་འདིའི་གླིང་ཐམས་ཅད་ཀྱི་གླིང་རེ་རེར་ཡང་དེ་ལྟ་བུའི་ལུས་དག་ཡོངས་སུ་བཏང་ཞིང་། རང་གི་ཤ་དང་ཁྲག་གིས་སེམས་ཅན་རྣམས་ཚིམ་པར་བྱས་པ་དེ་བཞིན་དུ་ཕྱོགས་བཅུ་གཞན་གྱི་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ཏུ་ཡང་དེ་ལྟ་བུའི་ལུས་དག་ཡོངས་སུ་བཏང་སྟེ། རང་གི་ཤ་དང་ཁྲག་གིས་སེམས་ཅན་རྣམས་ཚིམ་པར་བྱས་སོ།
en: Just as I gave away my body in that way in each of the continents in this buddha realm and satisfied beings with my flesh and blood, in the same way I gave away my body in the buddha realms in the ten directions, which are as numerous as the grains of sand in the Ganges River, and satisfied beings with my flesh and blood. “

source: །རིགས་ཀྱི་བུ་དེའི་ཚེ་ངས་རྒྱུན་མ་ཆད་པར་མིག་དག་ཡོངས་སུ་བཏང་བ་གང་ཡིན་པ་དེ་དག་གི་ཕུང་པོ་ཡང་འཛམ་བུའི་གླིང་འདི་ནས་སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷའི་མཐར་ཐུག་པའི་ཚད་ཙམ་དུ་གྱུར་ཏེ།
en: Noble son, during that time, the eyes that I continually gave away would reach from Jambudvīpa as high as the Trāyastriṃśa paradise.

source: དེ་བཞིན་གཤེགས་པའི་ལུས་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ལྟོས།
en: Observe the Tathāgata’s perfection of generosity through giving away his body!

source: རིགས་ཀྱི་བུ་དེ་ནི་དེ་བཞིན་གཤེགས་པའི་ལུས་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་མདོར་བསྡུས་པ་ཡིན་ནོ།
en: Noble son, that is a brief account of the Tathāgata’s perfection of generosity through giving away his body. “

source: །རིགས་ཀྱི་བུ་གཞན་ཡང་དེའི་འོག་ཏུ་བསྐལ་པ་ཚད་མེད་པ་འདས་པ་ན་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ཟླ་བ་རྣམ་པར་སྣང་བ་ཞེས་བྱ་བར་གྱུར་ཏེ། དེ་ཡང་སྙིགས་མ་ལྔ་དང་ལྡན་པར་གྱུར་ཏོ།
en: Noble son, after that, when countless eons had passed, this buddha realm had the name Candravidyuta and had the five degeneracies.

source: །ང་ཡང་འཛམ་བུའི་གླིང་དེར་སྟོབས་ཀྱི་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་སྒྲོན་མ་སྣང་བ་ཞེས་བྱ་བར་གྱུར་ནས་ངས་ཇི་སྐད་སྔར་སྨོས་པ་བཞིན་དུ་འཛམ་བུའི་གླིང་གི་སེམས་ཅན་ཐམས་ཅད་དགེ་བ་དག་ལ་ངེས་པར་སྦྱར་ཏོ།
en: I was a powerful cakravartin named Pradīpapradyota in this Jambudvīpa. As previously described, I brought all the beings in Jambudvīpa to the practice of the ten good actions.

source: །ཕྱིས་ང་རང་གིས་བལྟ་བའི་ཕྱིར་སྐྱེད་མོས་ཚལ་གྱི་སར་བྱུང་བ་དང་།
en: Afterward, I went to a park to look at the land.

source: དེ་ན་ངས་བཅིང་བ་དམ་པོས་ཕྱིན་ཀ་ལོག་ཏུ་བཅིངས་པའི་མི་ཞིག་མཐོང་ངོ་།
en: There I saw a man whose hands had been tightly bound behind his back.

source: །མཐོང་ནས་ཀྱང་ངས་བློན་པོ་རྣམས་ལ་མི་འདིས་ཅི་ཞིག་བྱས་ཞེས་དྲིས་པ་དང་།
en: When I saw him, I asked the ministers, ‘What did this man do?’ “

source: བློན་པོ་རྣམས་ཀྱིས་ང་ལ་སྨྲས་པ། ལྷ་མི་འདི་ནི་ལྷ་ལ་ནོངས་པ་བགྱིས་པ་ལགས་ཏེ།
en: The ministers said to me, ‘Your Majesty, this man has committed a crime against you.

source: དགུང་ལོ་གཅིག་ལ་མི་འདིའི་འབྲུ་དང་། ལོ་ཏོག་ཅི་འཁྲུང་བ་དེ་ལས་དྲུག་ཆ་གཅིག་ལྷའི་ཞལ་སྔར་འབུལ་བ་ལགས་ན།
en: Each year this man should give a sixth of his hay and corn to Your Majesty.

source: ཇི་ལྟར་ལྷའི་གྲོང་དང་། གྲོང་ཁྱེར་དང་། ལྗོངས་ཀྱི་མི་དང་། རི་བྲགས་དག་ན་གནས་པའི་འཕངས་ལས་ཀྱི་མཐས་འཚོ་བ་གཞན་དག་འདུ་བའི་སྒོ་འབུལ་བར་བགྱིད་པ་དེ་ལྟར་མི་འདི་འབུལ་བར་མི་བགྱིད་ལགས་སོ།
en: This man has not paid the tax as all your other working subjects who dwell in Your Majesty’s villages, towns, countryside, and mountains have.’ “

source: །དེ་དག་ལ་ངས་འདི་སྐད་ཅེས་སྨྲས་སོ། །མི་འདི་ཐོང་ལ་སུ་ལ་ཡང་མཐུས་ནོར་དང་འབྲུ་དག་མ་སྡུད་ཅིག །དེ་དག་གིས་སྨྲས་པ།
en: I ordered them, ‘Set that man free, and do not forcibly collect wealth and grain from anyone!’ “

source: ལྷ་འགའ་ཡང་སེམས་ཤིན་ཏུ་དད་པས་འབུལ་བར་མི་བགྱིད་དོ། །གདུགས་གཅིག་བཞིན་དུ་ལྷའི་ཞལ་ཟས་དང་། སྐྱེམས་དང་། ལོངས་སྤྱོད་དང་། ཡོངས་སུ་སྤྱད་པ་གང་ལགས་པ་དང་།
en: They said, ‘Your Majesty, no one will voluntarily give it.

source: ལྷའི་བཙུན་མོའི་འཁོར་དང་། ལྷ་མོ་དང་། ལྷའི་སྲས་རྣམས་དང་། སྲས་མོ་རྣམས་ཀྱི་ལོངས་སྤྱོད་དང་། ཡོངས་སུ་སྤྱད་པ་གང་ལགས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་གཞན་དག་ལས་འདུ་བ་ལགས་ན།
en: Your Majesty, the food and drink that you eat and enjoy each day, and that which is eaten and enjoyed by the queen’s attendants, and by the queen and by Your Majesty’s sons and daughters, all comes from what is collected from others.

source: འགའ་ཡང་སེམས་རབ་ཏུ་དང་བས་འབུལ་བར་མི་བགྱིད་ལགས་སོ།
en: No one will voluntarily give it.’ “

source: །དེ་ནས་ཤིན་ཏུ་ཡིད་མི་བདེ་སྟེ་བསམས་པ། ངས་འཛམ་བུའི་གླིང་ཐམས་ཅད་ཀྱི་རྒྱལ་སྲིད་ཀྱི་དབང་ཕྱུག་འདི་སུ་ལ་སྦྱིན་པར་བྱ་སྙམ་ནས།
en: Then I was deeply saddened and thought, ‘To whom shall I give my dominion over the entire kingdom of Jambudvīpa?’

source: ང་ལ་བུ་ལྔ་བརྒྱ་ཡོད་པར་གྱུར་པ་དེ་དག་ཀྱང་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་བཅུག་ཅིང་། འཛམ་བུའི་གླིང་འདི་ཡང་ཆ་ལྔ་བརྒྱར་བགོས་ཏེ་བུ་རྣམས་ལ་བྱིན་ནས།
en: I made my five hundred sons aspire for enlightenment and I divided Jambudvīpa into five hundred parts.
